Rails/vTweet/app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    if(current_user)
      @user = User.find(current_user)